diary/2025-02-02.html
<!doctype html>
<html lang="ja">
  <head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>ABC 391, 関数の特殊化 - toybeam</title>
    <meta name="description" content="devlog of toyboot4e" />
    <link rel="stylesheet" href="/style/simple.min.css" />
    <link rel="stylesheet" href="/style/style.css" />
    <link rel="stylesheet" href="/style/prism.css" />
    <!-- MathJax -->
  </head>
  <body>
    <header role="banner">
      <h1>ABC 391, 関数の特殊化</h1>
      <p>Feb 2, 2025</p>
      <nav role="navigation">
        <a href="/index.html">Home</a><a href="https://github.com/toyboot4e">GitHub</a>
      </nav>
    </header>
    <main role="main">
      <h2 id="ABC 391"><a href="#ABC 391">ABC 391</a></h2>
      <p><a href="https://atcoder.jp/contests/abc391">ABC 391</a> に参加しました。<br /></p>

      <table>
        <caption class="t-above">
          <span class="table-number">Table 1:</span>
          Diff 予想
        </caption>

        <colgroup>
          <col class="org-left" />

          <col class="org-right" />

          <col class="org-right" />

          <col class="org-right" />

          <col class="org-left" />

          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <thead>
          <tr>
            <th scope="col" class="org-left">問題</th>
            <th scope="col" class="org-right">A 問題</th>
            <th scope="col" class="org-right">B 問題</th>
            <th scope="col" class="org-right">C 問題</th>
            <th scope="col" class="org-left">D 問題</th>
            <th scope="col" class="org-left">E 問題</th>
            <th scope="col" class="org-left">F 問題</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td class="org-left">提出</td>
            <td class="org-right">AC</td>
            <td class="org-right">AC</td>
            <td class="org-right">AC</td>
            <td class="org-left">AC</td>
            <td class="org-left">AC</td>
            <td class="org-left">TLE</td>
          </tr>

          <tr>
            <td class="org-left">予想 diff</td>
            <td class="org-right">10</td>
            <td class="org-right">100</td>
            <td class="org-right">400</td>
            <td class="org-left">1,300</td>
            <td class="org-left">1,000</td>
            <td class="org-left">1,800</td>
          </tr>

          <tr>
            <td class="org-left">実際 diff</td>
            <td class="org-right">10</td>
            <td class="org-right">110</td>
            <td class="org-right">209</td>
            <td class="org-left">924</td>
            <td class="org-left">1,165</td>
            <td class="org-left">1,534</td>
          </tr>
        </tbody>
      </table>
      <h3 id="A 問題">
        <a href="#A 問題"><a href="https://atcoder.jp/contests/abc391/tasks/abc391_a">A 問題</a></a>
      </h3>
      <p>八方位が <code>N, NE, E, ..</code> の形式で与えられる。反対方向を出力せよ。<br /></p>

      <p>八方位を配列に入れれば、添字 \(i\) を \(i + 4 \pmod 8\) すれば良いです:<br /></p>

      <div class="org-src-container">
        <pre><code class="src language-haskell">dirs :: [String]
dirs = ["N", "NE", "E", "SE", "S", "SW", "W", "NW"]

solve :: StateT BS.ByteString IO ()
solve = do
  !s &lt;- BS.unpack &lt;$&gt; line'
  let i = fromJust $ elemIndex s dirs
  printBSB $ dirs !! ((i + 4) `mod` 8)
</code></pre>
      </div>

      <p>天才解法は文字列置換です:<br /></p>

      <div class="org-src-container">
        <pre><code class="src language-bash">tr NESW SWNE # bash
</code></pre>
      </div>
      <h3 id="B 問題">
        <a href="#B 問題"><a href="https://atcoder.jp/contests/abc391/tasks/abc391_b">B 問題</a></a>
      </h3>
      <p>
        2 つの長方形が与えられたとき、模様がマッチする部分を答えよ。例によって 2
        次元配列のテンプレートを使います:<br />
      </p>

      <div class="org-src-container">
        <pre><code class="src language-haskell">solve :: StateT BS.ByteString IO ()
solve = do
  (!n, !m) &lt;- ints2'
  !s &lt;- getGrid' n n
  !t &lt;- getGrid' m m

  -- s 上の (i, j) に t を置いたとき、模様が一致するか判定する
  let test i j = and [s @!? (i + dy, j + dx) == Just (t @! (dy, dx)) | dy &lt;- [0 .. m - 1], dx &lt;- [0 .. m - 1]]
  -- すべての (i, j) を試す
  let (!y, !x) = head [(y, x) | y &lt;- [0 .. n - 1], x &lt;- [0 .. n - 1], test y x]
  printBSB (y + 1, x + 1)
</code></pre>
      </div>
      <h3 id="C 問題">
        <a href="#C 問題"><a href="https://atcoder.jp/contests/abc391/tasks/abc391_c">C 問題</a></a>
      </h3>
      <p>配列の上を要素が移動するとき、要素のダブりがあるスロットの数を追跡せよ。<br /></p>

      <p>
        可変配列が要求されて辛い問題でした。クエリは <code>mapMaybeM</code> で処理しました。<br />
      </p>
      <h3 id="D 問題">
        <a href="#D 問題"><a href="https://atcoder.jp/contests/abc391/tasks/abc391_d">D 問題</a></a>
      </h3>
      <p>
        テトリスのシミュレーション時に、 \(t_i\) 秒後に 1x1 サイズの正方形 \(A_i\)
        が消滅していないか答えよ。 \(x\) 座標毎に \(i\) 番目のブロックの位置を求め、 \(i\)
        番目の位置のブロックの max を計算します。 naoya さんの
        <a
          href="https://publish.obsidian.md/naoya/atcoder/ABC391+%E6%8C%AF%E3%82%8A%E8%BF%94%E3%82%8A"
          ><code>tranpose</code> による実装</a
        >
        が綺麗でした。<br />
      </p>
      <h3 id="E 問題">
        <a href="#E 問題"><a href="https://atcoder.jp/contests/abc391/tasks/abc391_e">E 問題</a></a>
      </h3>
      <p>3 分木を再帰的に畳み込め。と読解できればボトムアップで解けました。<br /></p>

      <p>まず <code>Vector</code> を 3 要素ずつに分解します:<br /></p>

      <div class="org-src-container">
        <pre><code class="src language-haskell">chunks3 :: (U.Unbox a) =&gt; U.Vector a -&gt; V.Vector (U.Vector a)
chunks3 xs = V.unfoldrExactN (G.length xs `div` 3) (G.splitAt 3) xs
</code></pre>
      </div>

      <p>ノードには <code>(多数決の結果, 結果反転の最小コスト)</code> を載せます:<br /></p>

      <div class="org-src-container">
        <pre><code class="src language-haskell">reduce :: U.Vector (Int, Int) -&gt; U.Vector (Int, Int)
reduce = V.convert . V.map eval . chunks3
  where
    eval xs = {- .. -}
</code></pre>
      </div>

      <p><code>n</code> 回 <code>reduce</code> して解答します。<br /></p>
      <h3 id="F 問題">
        <a href="#F 問題"><a href="https://atcoder.jp/contests/abc391/tasks/abc391_f">F 問題</a></a>
      </h3>
      <p>ヒープで TLE, 検討中です。ヒープの実装が遅いってことも無いと思うのですが。<br /></p>
      <h2 id="Misc"><a href="#Misc">Misc</a></h2>
      <h3 id="INLINE 以外の信じられるもの">
        <a href="#INLINE 以外の信じられるもの"><code>INLINE</code> 以外の信じられるもの</a>
      </h3>
      <p>
        Haskell は 1 行の差で 10 倍遅くなることで有名な言語です。特にモジュールを跨ぐ場合には、
        pragma 無しだと低速になること必至！　しかし link/cut tree の関数は巨大で、すべてを
        <code>INLINE</code> 化するとコンパイルに失敗しました。 <code>INLINE</code> 無しだと C++ の
        10 倍遅いので、対策が必須です。<br />
      </p>

      <p>
        この件を
        <a href="https://github.com/toyboot4e/lct-bench">toyboot4e/lct-bench</a> で質問したところ、
        <code>INLINABLE</code> を付けて 10 倍高速化して頂きました。モジュールをまたぐ場合は、
        <code>INLINABLE</code> を付けなければ関数の特殊化が行われず
        <code>PrimMonad</code> が辞書渡しになり、非常に低速となる模様です。<br />
      </p>

      <p>
        (おそらく) これを機に
        <a
          href="https://zenn.dev/mod_poppo/articles/haskell-primmonad#%E3%83%A2%E3%83%8A%E3%83%89%E3%82%B9%E3%82%BF%E3%83%83%E3%82%AF%E3%81%8C%E7%A9%8D%E3%81%BE%E3%82%8C%E3%81%A6%E3%81%84%E3%82%8B%E5%A0%B4%E5%90%88%EF%BC%9Asttoprim-%E3%81%AE%E5%88%A9%E7%94%A8"
          >HaskellのPrimMonadとうまく付き合う その1</a
        >
        が執筆されました。自分でも色々試した感じ、 <code>INLINE</code> の方が
        <code>INLINEABLE</code> よりも高速な傾向にあります。<br />
      </p>

      <table>
        <colgroup>
          <col class="org-right" />

          <col class="org-left" />

          <col class="org-left" />

          <col class="org-left" />

          <col class="org-left" />

          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <thead>
          <tr>
            <th scope="col" class="org-right">No</th>
            <th scope="col" class="org-left">モナド</th>
            <th scope="col" class="org-left">pragma</th>
            <th scope="col" class="org-left">stToPrim</th>
            <th scope="col" class="org-left">ST/IO</th>
            <th scope="col" class="org-left">モナドスタック</th>
            <th scope="col" class="org-left">判定</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td class="org-right">1</td>
            <td class="org-left"><code>PrimMonad</code></td>
            <td class="org-left">-</td>
            <td class="org-left">-</td>
            <td class="org-left">遅い</td>
            <td class="org-left">遅い</td>
            <td class="org-left">絶対ダメ！</td>
          </tr>

          <tr>
            <td class="org-right">2</td>
            <td class="org-left"><code>PrimMonad</code></td>
            <td class="org-left"><code>INLINE</code></td>
            <td class="org-left">-</td>
            <td class="org-left">速い</td>
            <td class="org-left">やや遅い</td>
            <td class="org-left">良し</td>
          </tr>

          <tr>
            <td class="org-right">3</td>
            <td class="org-left"><code>PrimMonad</code></td>
            <td class="org-left"><code>INLINE</code></td>
            <td class="org-left"><code>stToPrim</code></td>
            <td class="org-left">やや遅い</td>
            <td class="org-left">速い</td>
            <td class="org-left">良し</td>
          </tr>

          <tr>
            <td class="org-right">4</td>
            <td class="org-left"><code>PrimMonad</code></td>
            <td class="org-left"><code>INLINEABLE</code></td>
            <td class="org-left">-</td>
            <td class="org-left">やや遅い</td>
            <td class="org-left">遅い</td>
            <td class="org-left">絶対ダメ！</td>
          </tr>

          <tr>
            <td class="org-right">5</td>
            <td class="org-left"><code>PrimMonad</code></td>
            <td class="org-left"><code>INLINEABLE</code></td>
            <td class="org-left"><code>stToPrim</code></td>
            <td class="org-left">やや遅い</td>
            <td class="org-left">やや遅い</td>
            <td class="org-left">良し</td>
          </tr>
        </tbody>
      </table>

      <p>
        業務ならコンパイルの速い No 5 が良さそうです。 <code>PrimMonad</code> (型クラス)
        を特殊化しつつ、コンパイル時間も肥大しません。速度優先なら <code>INLINE</code> 指定の No 2
        か No 3 が良さそうです。<br />
      </p>
      <h3 id="vector-algorithms 高速化">
        <a href="#vector-algorithms 高速化"><code>vector-algorithms</code> 高速化</a>
      </h3>
      <p>
        <code>vector-algorithms</code> の <code>nub</code>, <code>sort</code> 等が低速な件で
        <a href="https://github.com/erikd/vector-algorithms/pull/51">PR</a> を出しました。
        <a href="https://github.com/toyboot4e/va-bench">ベンチマーク</a> を取りましたし、 Core
        もチラ見しています。要は <code>INLINE</code> の方が速いというだけの内容です。<br />
      </p>
      <h3 id="Magit が動かない？"><a href="#Magit が動かない？">Magit が動かない？</a></h3>
      <p>
        <code>magit-file-icons</code> に
        <a href="https://github.com/gekoke/magit-file-icons/issues/17">Issue</a> を立てました。
        <code>git bisect run 'rg' 'magit-insert-files-1'</code>
        が便利！　修正はオーナーにお願いしたいです。たぶんフック先を変えるだけだと思うのですが。<br />
      </p>
      <h3 id="競プロ用の flake.nix">
        <a href="#競プロ用の flake.nix">競プロ用の <code>flake.nix</code></a>
      </h3>
      <p>
        <code>atcoder-cli</code> と <code>oj-verify</code> を Nix 経由で入れられるようになりました。
        Source は
        <a href="https://github.com/berberman/nvfetcher"><code>nvfetcher</code></a>
        で取ったほうが更新が楽かも。<br />
      </p>

      <details>
        <summary>
          <code>flake.nix</code>
        </summary>
        <div class="org-src-container">
          <pre><code class="src language-nix">{
  description = "A basic flake with a shell";

  inputs = {
    nixpkgs.url = "github:NixOS/nixpkgs/nixpkgs-unstable";
    flake-utils.url = "github:numtide/flake-utils";
  };

  outputs =
    { nixpkgs, flake-utils, ... }:
    flake-utils.lib.eachDefaultSystem (
      system:
      let
        pkgs = import nixpkgs { inherit system; };
        # https://github.com/lmdexpr/contest/blob/d7d7e84034cf1ce6e54a59ffb0435e5edafa873e/flake.nix#L83C1-L95C11
        atcoder-cli = pkgs.buildNpmPackage {
          pname = "atcoder-cli";
          version = "2.2.0";
          src = pkgs.fetchFromGitHub {
            owner = "Tatamo";
            repo = "atcoder-cli";
            rev = "f385e71ba270716f5a94e3ed9bd23a24f78799d0";
            sha256 = "sha256-7pbCTgWt+khKVyMV03HanvuOX2uAC0PL9OLmqly7IWE=";
          };
          npmDepsHash = "sha256-ufG7Fq5D2SOzUp8KYRYUB5tYJYoADuhK+2zDfG0a3ks=";
          npmPackFlags = [ "--ignore-scripts" ];
          NODE_OPTIONS = "--openssl-legacy-provider";
        };
        oj-verify =
          with pkgs.python3Packages;
          pkgs.python3Packages.buildPythonApplication {
            name = "verification-helper";
            version = "5.6.0";
            pyproject = true;
            src = pkgs.fetchFromGitHub {
              owner = "online-judge-tools";
              repo = "verification-helper";
              rev = "adbff121b1f96de5f34e9f1483eb47d661c54075";
              fetchSubmodules = false;
              sha256 = "sha256-f7Ge8kLRQv9uxdNGtgNsypGVY0XAnKPCg8HYQ5nT6mI=";
            };
            build-system = [ setuptools ];
            dependencies = [
              colorlog
              importlab
              online-judge-tools
              pyyaml
              setuptools
              toml
            ];
            propagatedBuildInputs = [ setuptools ];
          };
      in
      {
        devShells.default =
          with pkgs;
          mkShell {
            packages = [
              atcoder-cli
              online-judge-tools
              oj-verify
            ];
          };
        shellHook = ''
          acc config oj-path $(which oj)
        '';
      }
    );
}
</code></pre>
        </div>
      </details>

      <p>参考:<br /></p>

      <ul>
        <li>
          <a href="https://github.com/gawakawa/atcoder-haskell">gawakawa/atcoder-haskell</a><br />
        </li>
        <li><a href="https://github.com/lmdexpr/contest">lmdexpr/contest</a><br /></li>
      </ul>
      <h3 id="キーボード"><a href="#キーボード">キーボード</a></h3>
      <p>
        <a href="https://github.com/Bastardkb/Dilemma">Dilemma</a>
        キーボードが格好いい。自分でパーツを集めなくても Kit
        の販売があるので、発注してみました。発送待ちです。<br />
      </p>
      <h3 id="音楽"><a href="#音楽">音楽</a></h3>
      <p><a href="https://www.behemoth.pl/">Behemoth</a> の新盤が 5 月に出ます。やった！<br /></p>

      <p>
        <a href="https://publibjp.com/books/isbn978-4-908468-81-0"
          >メロディック・ブラックメタル・ガイドブック</a
        >
        をぺらぺらと見ています。
        <a href="https://swornnorway.bandcamp.com/album/a-journey-told-through-fire">Sworn</a>
        が載っていて嬉しい。
        <a href="https://blissofflesh.bandcamp.com/album/tyrant-3">Bliss of Flesh</a>
        も一瞬出てきましたが、本当に一言しかコメントが無くて無常を感じます。もう少し予算があれば紙面を割けそうです。<br />
      </p>

      <p>
        音楽は消化が難しく、 1 月あたり 1 バンド未満のペースで聴いています。最近は
        <a href="https://inannametal.bandcamp.com/album/void-of-unending-depths">INANNA</a>
        が良い感じです。<br />
      </p>
    </main>
    <footer role="contentinfo">
      <p>Styled with <a href="https://simplecss.org/">Simple.css</a></p>
      <div><a href="/index.html">Home</a><a href="https://github.com/toyboot4e">GitHub</a></div>
    </footer>
  </body>
</html>
